Revit 2024 API
ModelCurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ModelCurveArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ModelCurveArrayIterator
Visual C++
public:
virtual ModelCurveArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace